Catalogs/бит_си_Статьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_си_Статьи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Comment>ID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВСодержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МестаИспользования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМетки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопИнформация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_си_УстановленныеМеткиСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_си_УстановленныеМеткиСтатей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_си_Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_си_МеткиСтатей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_си_СвязанныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_си_СвязанныеОбъекты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_си_Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДляОтборов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_си_МеткиСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_си_МеткиСтатей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пиктограмма</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВСодержании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВДопСсылках</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВЗаголовке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРезультатахПоиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_си_ВыводМеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_си_Источники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_си_Источники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаЗаголовкаСИ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПоУмолчанию</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучениеТекущегоОбъектаНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучениеТекущегоОбъектаНастройки_Удалить</Name>
					<Comment>Оставлен для совместимости с предыдущими версиями</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_си_Статьи/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура обработчик - события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТекстСтатьиНаСервере(Объект.Ссылка);
	ЗаполнитьДеревоМеток(Объект.Ссылка); 
	ЗаполнитьДеревоОтборов(Объект.Ссылка);
	ЗаполнитьДеревоСвязанныхОбъектов(Объект.Ссылка);
	
	ОткрытаяСтраницаСтатьи = Элементы.ГруппаТекстСтатьиРедактирование.ТекущаяСтраница.Имя;
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
	
		 ВнутреннийИД = Объект.Ссылка.УникальныйИдентификатор();
	
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик - события "ОбработкаОповещения" формы.
// 
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаСтатьяСправки" Тогда
		Если Параметр = Объект.Ссылка Тогда
			ОбновитьТекстСтатьиНаСервере(Объект.Ссылка);
			ЗаполнитьДеревоМеток(Объект.Ссылка); 
			ЗаполнитьДеревоОтборов(Объект.Ссылка);
			ЗаполнитьДеревоСвязанныхОбъектов(Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещения()

// Процедура обработчик - события "ПриЗаписиНаСервере" формы.
// 
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.бит_си_УстановленныеМеткиСтатей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Статья.Значение = ТекущийОбъект.Ссылка;
	НаборЗаписей.Отбор.Статья.Использование = Истина;
	УстановленныеМетки = УстановленныеМетки(Метки.ПолучитьЭлементы());
	Для Каждого ТекСтрока Из УстановленныеМетки Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Статья = ТекущийОбъект.Ссылка;
		Запись.Метка = ТекСтрока.Метка;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		// Сообщить("При записи меток статьи произошла ошибка: " + Описание);
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='При записи меток статьи произошла ошибка: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Описание);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
		
	НаборЗаписей = РегистрыСведений.бит_си_СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Статья.Значение = ТекущийОбъект.Ссылка;
	НаборЗаписей.Отбор.Статья.Использование = Истина;
	НаборЗаписей.Отбор.ДляОтборов.Значение = Истина;
	НаборЗаписей.Отбор.ДляОтборов.Использование = Истина;
	Для Каждого ТекТип Из ОтборыОбъектов.ПолучитьЭлементы() Цикл
		Для Каждого ТекСтрока Из ТекТип.ПолучитьЭлементы() Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Статья		= ТекущийОбъект.Ссылка;
			Запись.Объект		= ТекСтрока.Объект;
			Запись.Тип			= ТекТип.Тип;
			Запись.ДляОтборов	= Истина;
		КонецЦикла;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		// Сообщить("При критериев отбора произошла ошибка: " + Описание);
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='При критериев отбора произошла ошибка: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Описание);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
	
	НаборЗаписей = РегистрыСведений.бит_си_СвязанныеОбъекты.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Статья.Значение = ТекущийОбъект.Ссылка;
	НаборЗаписей.Отбор.Статья.Использование = Истина;
	НаборЗаписей.Отбор.ДляОтборов.Значение = Ложь;
	НаборЗаписей.Отбор.ДляОтборов.Использование = Истина;
	Для Каждого ТекТип Из СвязанныеОбъекты.ПолучитьЭлементы() Цикл
		Для Каждого ТекСтрока Из ТекТип.ПолучитьЭлементы() Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Статья		= ТекущийОбъект.Ссылка;
			Запись.Объект		= ТекСтрока.Объект;
			Запись.Тип			= ТекТип.Тип;
			Запись.ДляОтборов	= Ложь;
		КонецЦикла;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Описание = ОписаниеОшибки();
		// Сообщить("При записи связанных объектов произошла ошибка: " + Описание);
		Сообщение = Новый СообщениеПользователю();
		ТекстСообщения = НСтр("ru='При записи связанных объектов произошла ошибка: %1.'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Описание);
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

// Процедура обработчик - события "ПередЗаписьюНаСервере" формы.
// 
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ТекстHTML = РабочийТекстHTML;
	
	СтруктураКартинок = Новый Структура();
	НомерКартинки = 0;
	Если ПараметрыЗаписи.Свойство("СписокИзображений") Тогда
		
		Для Каждого ТекКартинка Из ПараметрыЗаписи.СписокИзображений Цикл
			НомерКартинки = НомерКартинки + 1;
			ДанныеКартинки = ПолучитьИзВременногоХранилища(ТекКартинка.Значение);
			СтруктураКартинок.Вставить("image" + СокрЛП(НомерКартинки), Новый Картинка(ДанныеКартинки));
			ТекущийОбъект.ТекстHTML = СтрЗаменить(ТекущийОбъект.ТекстHTML, ТекКартинка.Представление, "image" + СокрЛП(НомерКартинки));
			
			ТекКартинка.Представление	= "image" + СокрЛП(НомерКартинки);
			ТекКартинка.Значение		= ДанныеКартинки;
		КонецЦикла;
		
		ТекущийОбъект.Изображения = Новый ХранилищеЗначения(ПараметрыЗаписи.СписокИзображений);
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура обработчик - события "ПередЗаписью" формы.
// 
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ОткрытаяСтраницаСтатьи = "ГруппаРедактирование" И Модифицированность Тогда 
		ОбновитьРабочийТекстИзПоляРедактирования();
	ИначеЕсли ОткрытаяСтраницаСтатьи = "ГруппаHTML" И Модифицированность Тогда
		ОбновитьТекстПоляРедактированияИзРабочегоТекста(ПараметрыЗаписи.СписокИзображений);
	КонецЕсли;
	ПараметрыЗаписи.Вставить("СписокИзображений", ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
	
КонецПроцедуры

// Процедура обработчик - события "ПослеЗаписи" формы.
// 
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененаСтатьяСправки", Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура обработчик - события "ПриИзменении" элемента "ТекстСтатьиРедактирование".
// 
&НаКлиенте
Процедура ТекстСтатьиРедактированиеПриИзменении(Элемент)
	
	ОбновитьРабочийТекстИзПоляРедактирования();
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры // ТекстСтатьиРедактированиеПриИзменении().

// Процедура обработчик - события "ПриИзменении" элемента "ТекстСтатьиHTML".
// 
&НаКлиенте
Процедура ТекстСтатьиHTMLПриИзменении(Элемент)
	
	СписокИзображений = ПолучитьСписокИзображенийВТексте(РабочийТекстHTML);
	
	ОбновитьТекстПоляРедактированияИзРабочегоТекста(СписокИзображений);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

// Процедура обработчик - события "ПриСменеСтраницы" элемента "ГруппаТекстСтатьиРедактирование".
// 
&НаКлиенте
Процедура ГруппаТекстСтатьиРедактированиеПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// переделываем на смену страниц, чтобы пользователь мог работать сколько хотел.
	Если ОткрытаяСтраницаСтатьи = "ГруппаРедактирование" И Модифицированность Тогда 
		ОбновитьРабочийТекстИзПоляРедактирования();
	ИначеЕсли ОткрытаяСтраницаСтатьи = "ГруппаHTML" И Модифицированность Тогда 
		ОбновитьТекстПоляРедактированияИзРабочегоТекста(ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));
	КонецЕсли;
	
	ОткрытаяСтраницаСтатьи = ТекущаяСтраница.Имя;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязанныеОбъекты

// Процедура обработчик - события "ПередНачаломДобавления" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Копирование = Истина Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.СвязанныеОбъекты.ТекущаяСтрока = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		Отказ = Истина;
		НоваяСтрока = Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
		Элементы.СвязанныеОбъекты.ТекущаяСтрока = Элементы.СвязанныеОбъекты.ТекущаяСтрока + 1;
		СвязанныеОбъектыПриНачалеРедактирования(Элементы.СвязанныеОбъекты, Истина, Ложь);
	КонецЕсли;
КонецПроцедуры

// Процедура обработчик - события "ПриНачалеРедактирования" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.СвязанныеОбъекты.ТекущиеДанные;
		ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
		ТекущаяСтрока.Объект	= Новый (Тип(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка.")));
		Элемент.ПодчиненныеЭлементы.СвязанныеОбъектыОбъект.ОграничениеТипа = Новый ОписаниеТипов(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка."));
		Элемент.ПодчиненныеЭлементы.СвязанныеОбъектыОбъект.ВыбиратьТип = Ложь;
	КонецЕсли;
КонецПроцедуры

// Процедура обработчик - события "ПередНачаломИзменения" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

// Процедура обработчик - события "ПередУдалением" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыПередУдалением(Элемент, Отказ)
	Если Элементы.СвязанныеОбъекты.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

// Процедура обработчик - события "ПриИзменении" табличного поля "СвязанныеОбъекты".
// 
&НаКлиенте
Процедура СвязанныеОбъектыОбъектПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СвязанныеОбъекты.ТекущиеДанные;
	ТекущаяСтрока = Элементы.СвязанныеОбъекты.ТекущаяСтрока;
	НайденаяСтрока = Неопределено;
	СтрокиДляПроверки = ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекСтрока Из СтрокиДляПроверки Цикл
		Если НЕ ТекСтрока.ПолучитьИдентификатор() = ТекущаяСтрока И ТекСтрока.Объект = ТекущиеДанные.Объект Тогда
			НайденаяСтрока = ТекСтрока.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НайденаяСтрока = Неопределено Тогда
		СтрокиДляПроверки.Удалить(СтрокиДляПроверки.Индекс(ТекущиеДанные));
		Элементы.ОтборыОбъектов.ТекущаяСтрока = НайденаяСтрока;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтборыОбъектов

// Процедура обработчик - события "ПередНачаломДобавления" элемента "ОтборыОбъектов".
// 
&НаКлиенте
Процедура ОтборыОбъектовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование = Истина Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.ОтборыОбъектов.ТекущаяСтрока = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Элементы.ОтборыОбъектов.ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		Отказ = Истина;
		НоваяСтрока = Элементы.ОтборыОбъектов.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
		Элементы.ОтборыОбъектов.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ОтборыОбъектовПриНачалеРедактирования(Элементы.ОтборыОбъектов, Истина, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик - события "ПриНачалеРедактирования" табличного поля "ОтборыОбъектов".
// 
&НаКлиенте
Процедура ОтборыОбъектовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.ОтборыОбъектов.ТекущиеДанные;
		Если ТекущаяСтрока.ПолучитьРодителя().Тип = "#Роль" Тогда
			ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
			ТекущаяСтрока.Объект	= "";
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ВыбиратьТип = Ложь;
		ИначеЕсли ТекущаяСтрока.ПолучитьРодителя().Тип = "#РежимЗапуска" Тогда
			ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
			ТекущаяСтрока.Объект	= "";
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ВыбиратьТип = Ложь;
		Иначе
			ТекущаяСтрока.Тип		= ТекущаяСтрока.ПолучитьРодителя().Тип;
			ТекущаяСтрока.Объект	= Новый (Тип(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка.")));
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ОграничениеТипа = Новый ОписаниеТипов(СтрЗаменить(ТекущаяСтрока.Тип, ".", "Ссылка."));
			Элемент.ПодчиненныеЭлементы.ОтборыОбъектовОбъект.ВыбиратьТип = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик - события "ПередНачаломИзменения" табличного поля "ОтборыОбъектов".
// 
&НаКлиенте
Процедура ОтборыОбъектовПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.ОтборыОбъектов.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик - события "ПриИзменении" табличного поля "ОтборыОбъектовОбъект".
// 
&НаКлиенте
Процедура ОтборыОбъектовОбъектПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтборыОбъектов.ТекущиеДанные;
	ТекущаяСтрока = Элементы.ОтборыОбъектов.ТекущаяСтрока;
	НайденаяСтрока = Неопределено;
	СтрокиДляПроверки = ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы();
	Для Каждого ТекСтрока Из СтрокиДЛяПроверки Цикл
		Если НЕ ТекСтрока.ПолучитьИдентификатор() = ТекущаяСтрока И ТекСтрока.Объект = ТекущиеДанные.Объект Тогда
			НайденаяСтрока = ТекСтрока.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НайденаяСтрока = Неопределено Тогда
		СтрокиДляПроверки.Удалить(СтрокиДляПроверки.Индекс(ТекущиеДанные));
		Элементы.ОтборыОбъектов.ТекущаяСтрока = НайденаяСтрока;
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура обработчик - события "НачалоВыбора" табличного поля "ОтборыОбъектовОбъект".
// 
&НаКлиенте
Процедура ОтборыОбъектовОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ОтборыОбъектов.ТекущиеДанные.Тип = "#Роль" Тогда
		СтандартнаяОбработка = Ложь;
	
		СписокРолей = ПолучитьСписокРолей();
		ТекРоль = ВыбратьИзСписка(СписокРолей, Элемент, СписокРолей.НайтиПоЗначению(Элементы.ОтборыОбъектов.ТекущиеДанные.Объект));
		Если НЕ ТекРоль = Неопределено Тогда
			Элементы.ОтборыОбъектов.ТекущиеДанные.Объект = ТекРоль.Значение;
			ОтборыОбъектовОбъектПриИзменении(Элемент);
		КонецЕсли;
	ИначеЕсли Элементы.ОтборыОбъектов.ТекущиеДанные.Тип = "#РежимЗапуска" Тогда
		СтандартнаяОбработка = Ложь;
	
		СписокРежимов = Новый СписокЗначений();
		СписокРежимов.Добавить("Обычный", "Обычный");
		СписокРежимов.Добавить("Управляемый", "Управляемый");
		ТекРежим = ВыбратьИзСписка(СписокРежимов, Элемент, СписокРежимов.НайтиПоЗначению(Элементы.ОтборыОбъектов.ТекущиеДанные.Объект));
		Если НЕ ТекРежим = Неопределено Тогда
			Элементы.ОтборыОбъектов.ТекущиеДанные.Объект = ТекРежим.Значение;
			ОтборыОбъектовОбъектПриИзменении(Элемент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура обработчик - события "ЗагрузитьHTMLИзФайла" кнопки командной панели "ГруппаЗагрузитьСохранитьОтмена".
// 
&НаКлиенте
Процедура ЗагрузитьHTMLИзФайла(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Или 
		Элементы.Список.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Web-страница (*.htm,*.html)|*.htm;*.html";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если НЕ ДиалогОткрытияФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ВремДок = Новый ТекстовыйДокумент();
	ВремДок.Прочитать(ДиалогОткрытияФайла.ПолноеИмяФайла);
	РабочийТекстHTML = ВремДок.ПолучитьТекст();
	
	ОбновитьТекстПоляРедактированияИзРабочегоТекста(ПолучитьСписокИзображенийВТексте(РабочийТекстHTML));

	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура обработчик - команды "ВставитьКартинкуИзБуфера" 
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента"
// Вставляет в текст статьи картинку из буфера обмена.
// 
&НаКлиенте
Процедура ВставитьКартинкуИзБуфера(Команда)
	
	ВремДанныеРегистратора = "";
	ВремДанныеБиблиотеки = "";
	ПолучитьПараметрыБиблиотекиУтилитСервер(ВремДанныеРегистратора, ВремДанныеБиблиотеки);
	Если НЕ бит_Утилиты.ЕстьКартинкаВБуфереОбмена(ВремДанныеБиблиотеки, ВремДанныеРегистратора) Тогда
		Возврат;
	КонецЕсли;
	ВыбранноеИзображение = бит_Утилиты.ПолучитьКартинкуИзБуфераОбмена(ВремДанныеРегистратора,ВремДанныеБиблиотеки, "png");
	АдресВХранилище = ПоместитьВоВременноеХранилище(ВыбранноеИзображение, ЭтаФорма.УникальныйИдентификатор);
	ВставитьКартинкуСервер(АдресВХранилище);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

// Процедура обработчик - команды "ВставитьСсылкуНаСтатьюСправки",
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента".
// Вставляет в текст статьи ссылку на другую статью справки.
// 
&НаКлиенте
Процедура ВставитьСсылкуНаСтатьюСправки(Команда)
	
	ФормаСтатьи = ПолучитьФорму("Справочник.бит_си_Статьи.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтаФорма);
	РезСтруктура = ФормаСтатьи.ОткрытьМодально(30);
	Если НЕ РезСтруктура = Неопределено Тогда
		НачалоВыделения = "";
		КонецВыделения = "";
		Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
		
		ТекстДляВставки = "<a href=""ВнСсылка=" +
						  СокрЛП(РезСтруктура.УникальныйИдентификатор()) +
						  """> " +
						  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
						    РезСтруктура.НазваниеСтатьи,
							ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
						  " </a>";
		
		ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
		
		ВставитьТекстВHTMLСервер(ТекстДляВставки, НачалоВыделения);
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик - команды "ВставитьСсылкуНаОбъект" 
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента"
// Вставляет в текст статьи ссылку на форму элемента Справочника, Документа, форму Отчета, Обработки.
// 
&НаКлиенте
Процедура ВставитьСсылкуНаОбъект(Команда)
	
	ИменаКоллекций = Новый Массив;
	ИменаКоллекций.Добавить("Справочники");
	ИменаКоллекций.Добавить("Документы");
	ИменаКоллекций.Добавить("Отчеты");
	ИменаКоллекций.Добавить("Обработки");
	
	ФормаДерева = ПолучитьФорму("Справочник.бит_си_Статьи.Форма.ДеревоМетаданныхУправляемая", Новый Структура("ИменаКоллекций", ИменаКоллекций), ЭтаФорма);
	РезСтруктура = ФормаДерева.ОткрытьМодально(30);
	
	Если НЕ РезСтруктура = Неопределено Тогда
		НачалоВыделения = "";
		КонецВыделения = "";
		Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
		
		Если НЕ Найти("Справочники, Документы", РезСтруктура.ВидОбъекта) = 0 Тогда
			ФормаВыбора = ПолучитьФорму(РезСтруктура.ИмяОбъектаПолное + ".ФормаВыбора", , ЭтаФорма);
			ЗначениеВыбора = ФормаВыбора.ОткрытьМодально(30);
			Если ЗначениеВыбора <> Неопределено Тогда
				ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
								  РезСтруктура.ВидОбъекта +
								  "@" + РезСтруктура.ИмяОбъекта +
								  "@" + СокрЛП(ЗначениеВыбора.УникальныйИдентификатор()) +
								  """> " +
								  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
								    СокрЛП(ЗначениеВыбора),
									ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
								  " </a>";
			КонецЕсли; 
		Иначе	
			ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
							  РезСтруктура.ВидОбъекта +
							  "@" + РезСтруктура.ИмяОбъекта +
							  "@Форма" + """> " +
							  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
							    РезСтруктура.Синоним,
								ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
							  " </a>";
		КонецЕсли; 
		
		ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
		
		ВставитьТекстВHTMLСервер(ТекстДляВставки, НачалоВыделения);
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик - команды "ВставитьСсылкуНаФормуСписка",
// кнопки командной панели "КоманднаяПанельФорматированногоДокумента".
// Вставляет в текст статьи ссылку на форму списка Справочника, Документа, РегистраСведений.
// 
&НаКлиенте
Процедура ВставитьСсылкуНаФормуСписка(Команда)
	
	ИменаКоллекций = Новый Массив;
	ИменаКоллекций.Добавить("Справочники");
	ИменаКоллекций.Добавить("Документы");
	ИменаКоллекций.Добавить("РегистрыСведений");
	
	ФормаДерева = ПолучитьФорму("Справочник.бит_си_Статьи.Форма.ДеревоМетаданныхУправляемая", Новый Структура("ИменаКоллекций", ИменаКоллекций), ЭтаФорма);
	РезСтруктура = ФормаДерева.ОткрытьМодально(30);
	
	Если РезСтруктура <> Неопределено Тогда
		НачалоВыделения = "";
		КонецВыделения = "";
		Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
		
		ТекстДляВставки = "<a href=""ОбъектКонфигурации=" +
						  РезСтруктура.ВидОбъекта +
						  "@" + РезСтруктура.ИмяОбъекта +
						  "@ФормаСписка" + """> " +
						  ?(ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(НачалоВыделения) = ТекстСтатьиРедактирование.ПолучитьПозициюПоЗакладке(КонецВыделения),
						    РезСтруктура.Синоним,
							ТекстСтатьиРедактирование.ПолучитьТекст(НачалоВыделения, КонецВыделения)) +
						  " </a>";
						  
		ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
		
		ВставитьТекстВHTMLСервер(ТекстДляВставки, НачалоВыделения);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик - команды "Метки_РедактироватьМетку" кнопки командной панели таблмицы "Метки".
// 
&НаКлиенте
Процедура Метки_РедактироватьМетку(Команда)
	
	Если Элементы.Метки.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ОткрытьФорму("Справочник.бит_си_МеткиСтатей." + ?(Элементы.Метки.ТекущиеДанные.ЭтоГруппа, "ФормаГруппы", "ФормаОбъекта"),
				 Новый Структура("Ключ", Элементы.Метки.ТекущиеДанные.Метка),
				 ЭтаФорма);
				 
КонецПроцедуры

// Процедура обработчик - команды "Метки_ОткрытьСправочник" кнопки командной панели таблмицы "Метки".
// 
&НаКлиенте
Процедура Метки_ОткрытьСправочник(Команда)
	
	ОткрытьФорму("Справочник.бит_си_МеткиСтатей.ФормаСписка", , ЭтаФорма);
				 
КонецПроцедуры

// Процедура обработчик - команды "Метки_Обновить" кнопки командной панели таблмицы "Метки".
// 
&НаКлиенте
Процедура Метки_Обновить(Команда)
	
	ЗаполнитьДеревоМеток(Объект.Ссылка);
	
	СтрокиДерева = Метки.ПолучитьЭлементы();
	Дерево = Элементы.Метки;
	Для Каждого ТекСтрока Из СтрокиДерева Цикл
		Узел = ТекСтрока.ПолучитьИдентификатор();
		Если Дерево.Развернут(Узел) Тогда
			Продолжить;
		КонецЕсли;
		Дерево.Развернуть(Узел);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Помещает внешнюю библиотеку утилит во временное хранилище
// 
// Параметры 
// 	ВремДанныеРегистратора    	 -	Строка			        Адрес исполняемого файла регистратора библиотеки,
//															во временном хранилище.
// 	ВремДанныеБиблиотеки    	 -	Строка			        Адрес библиотеки утилит во временном хранилище.
//
&НаСервереБезКонтекста
Процедура ПолучитьПараметрыБиблиотекиУтилитСервер(ВремДанныеРегистратора, ВремДанныеБиблиотеки)
	
	ВремДанныеРегистратора = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.бит_РегистраторВнешнихБиблиотек.Имя),Новый УникальныйИдентификатор);
	ВремДанныеБиблиотеки = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.бит_Утилиты.Имя),Новый УникальныйИдентификатор);
	
КонецПроцедуры // ПолучитьПараметрыБиблиотекиУтилитСервер()

// Вставляет картинку в форматированный документ.
// 
// Параметры 
// 	АдресВХранилище    	 -	Строка			        Адрес картинки во временном хранилище.
//
&НаСервере
Процедура ВставитьКартинкуСервер(АдресВХранилище)
	
	КартинкаДляВставки = Новый Картинка(ПолучитьИзВременногоХранилища(АдресВХранилище));
	КартинкаДляВставки = КартинкаДляВставки.Преобразовать(ФорматКартинки.PNG);
	НачалоВыделения = "";
	КонецВыделения = "";
	Элементы.ТекстСтатьиРедактирование.ПолучитьГраницыВыделения(НачалоВыделения, КонецВыделения);
	ТекстСтатьиРедактирование.Удалить(НачалоВыделения, КонецВыделения);
	Элементы.ТекстСтатьиРедактирование.УстановитьГраницыВыделения(НачалоВыделения, НачалоВыделения);
	ТекстСтатьиРедактирование.Вставить(НачалоВыделения, КартинкаДляВставки, ТипЭлементаФорматированногоДокумента.Картинка);
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Вставляет текст HTML в текущую позицию курсора в форматированном документе.
// 
// Параметры 
// 	ТекстДляВставки    	 -	Строка			        Статья
// 	ПозицияВставки    	 -	Закладка				Текущая позиция курсора в форматированном документе.
//
&НаСервере
Процедура ВставитьТекстВHTMLСервер(ТекстДляВставки, ПозицияВставки)
	
	Элементы.ТекстСтатьиРедактирование.УстановитьГраницыВыделения(ПозицияВставки, ПозицияВставки);
		
	ТекстСтатьиРедактирование.Вставить(ПозицияВставки, "--СлужебныйТекстДляЗамены--", ТипЭлементаФорматированногоДокумента.Текст);
		
	ВремHTML = "";
	КартинкиПослеВставки = Новый Структура();
	ТекстСтатьиРедактирование.ПолучитьHTML(ВремHTML, КартинкиПослеВставки);
	ВремHTML = СтрЗаменить(ВремHTML, "--СлужебныйТекстДляЗамены--", ТекстДляВставки);
	ТекстСтатьиРедактирование.УстановитьHTML(ВремHTML, КартинкиПослеВставки);
		
КонецПроцедуры

// Получает список всех ролей, доступных в конфигурации.
// 
&НаСервереБезКонтекста
Функция ПолучитьСписокРолей()
	
	СписокРолей = Новый СписокЗначений();
	Для Каждого ТекРоль Из Метаданные.Роли Цикл
		СписокРолей.Добавить(ТекРоль.ПолноеИмя(), ТекРоль.Представление());
	КонецЦикла;
	
	Возврат СписокРолей;
	
КонецФункции // ПолучитьСписокРолей()

// Получает список изображений в тексте HTML, при обнаружении ссылки на локальный файл изображения,
// помещает такие файлы во временное хранилище и заменяет ссылку на адрес во временном хранилище.
//
// Параметры:
// 	пТекстHTML         	 -	Строка  				 Текст HTML для получения изображений.
//                          
&НаКлиенте
Функция ПолучитьСписокИзображенийВТексте(Знач пТекстHTML)
	
	сзСсылки = Новый СписокЗначений;
	src_Открыт = Ложь;
	ВсегоСтрок = СтрЧислоСтрок(пТекстHTML);
	
	Для СчСтрок = 1 По ВсегоСтрок Цикл
		ТекСтрока = СтрПолучитьСтроку(пТекстHTML, СчСтрок);
		ВсегоСимволов = СтрДлина(ТекСтрока);
		
		IMG_Начало = Найти(ВРег(ТекСтрока),"<IMG");
		
		Если IMG_Начало <> 0 Тогда
			IMG_Начало = IMG_Начало + 4;
			IMG_Путь = "";
			
			Для СчСимвол = IMG_Начало По ВсегоСимволов Цикл
				ТекСимвол = Сред(ТекСтрока, СчСимвол, 1);
				
				Если (ТекСимвол = Символ(34) ИЛИ ТекСимвол = Символ(39)) И src_Открыт Тогда
					
					Если Лев(IMG_Путь, 5) = "e1cib" ИЛИ Лев(IMG_Путь, 6) = "e1c://" Тогда
						ИмяДляЗамены = IMG_Путь;
					Иначе
						Попытка
							ИмяДляЗамены = "";
							ПоместитьФайл(ИмяДляЗамены, IMG_Путь, , Ложь, ЭтаФорма.УникальныйИдентификатор);
						Исключение
							IMG_Путь = "";
							src_Открыт = Ложь;
							Описание = ОписаниеОшибки();
							Продолжить;
						КонецПопытки;
					КонецЕсли;
					
					СчСимвол = СчСимвол - (СтрДлина(IMG_Путь) - СтрДлина(ИмяДляЗамены));
					ТекСтрока = СтрЗаменить(ТекСтрока, IMG_Путь, ИмяДляЗамены);
					
					сзСсылки.Добавить(ИмяДляЗамены, IMG_Путь);
					
					IMG_Путь = "";
					src_Открыт = Ложь;
				КонецЕсли;
				
				Если НРег(Сред(ТекСтрока, СчСимвол, 5)) = ("src=" + Символ(34)) ИЛИ НРег(Сред(ТекСтрока, СчСимвол, 5)) = ("src=" + Символ(39)) Тогда
					СчСимвол = СчСимвол + 5;
					src_Открыт = Истина;
				КонецЕсли;
				
				Если src_Открыт Тогда
					IMG_Путь = IMG_Путь + Сред(ТекСтрока, СчСимвол, 1);
				КонецЕсли;
			КонецЦикла; // по строке, символы.
		КонецЕсли; // встречается тег.
	КонецЦикла;	// по тексту, строки.

	Возврат сзСсылки;
	
КонецФункции

// Выполняет обновление текста HTML по результатм редактирования документа в поле форматированного документа
//
&НаСервере
Процедура ОбновитьРабочийТекстИзПоляРедактирования()
	
	СтруктураКартинок = Новый Структура();
	ТекстHTML = "";
	ТекстСтатьиРедактирование.ПолучитьHTML(ТекстHTML, СтруктураКартинок);
	Для Каждого ТекКартинка Из СтруктураКартинок Цикл
		АдресКартинки = ПоместитьВоВременноеХранилище(ТекКартинка.Значение.ПолучитьДвоичныеДанные(), ЭтаФорма.УникальныйИдентификатор);
		ТекстHTML = СтрЗаменить(ТекстHTML, ТекКартинка.Ключ, АдресКартинки);
	КонецЦикла;
	
	РабочийТекстHTML = ТекстHTML;
	
КонецПроцедуры

// Выполняет обновление форматированного документа по результатм редактирования текста HTML,
// и переданного списка картинок.
//
// Параметры 
// 	СписокКартинок     	 -	СписокЗначений 				 Список изовражений: Значение - адрес картинки во временном хранилище;
//														 Представление - ссылка на изображение как она используется в Тексте HTML.
//                          
&НаСервере
Процедура ОбновитьТекстПоляРедактированияИзРабочегоТекста(СписокКартинок)
	
	ТекстHTML = РабочийТекстHTML;
	СтруктураКартинок = Новый Структура();
	НомерКартинки = 0;
	Для Каждого ТекКартинка Из СписокКартинок Цикл
		НомерКартинки = НомерКартинки + 1;
		СтруктураКартинок.Вставить("image" + СокрЛП(НомерКартинки), Новый Картинка(ПолучитьИзВременногоХранилища(ТекКартинка.Значение)));
		ТекстHTML = СтрЗаменить(ТекстHTML, ТекКартинка.Представление, "image" + СокрЛП(НомерКартинки));
	КонецЦикла;
	
	ТекстСтатьиРедактирование.УстановитьHTML(ТекстHTML, СтруктураКартинок);
	
КонецПроцедуры

// Возвращает таблицу устаноленных меток
// 
// Параметры 
// 	Строки      	 	 -	КоллекцияСтрок         	 Строки для заполнения,
// 	ТабМетки	       	 -	ТаблицаЗначений       	 Таблица меток для заполнения,
// Возвращаемое значение:
// 	Возврат ...        	 -	ТаблицаЗначений        	 Таблица устаноленных меток.
//
&НаСервере
Функция УстановленныеМетки(Строки, ТабМетки = Неопределено)
	
	Если НЕ ТипЗнч(ТабМетки) = Тип("ТаблицаЗначений") Тогда
		ТабМетки = Новый ТаблицаЗначений();
		ТабМетки.Колонки.Добавить("Метка", Новый ОписаниеТипов("СправочникСсылка.бит_си_МеткиСтатей"));
	КонецЕсли;
	Для Каждого ТекСтрока Из Строки Цикл
		Если ТекСтрока.Метка.ЭтоГруппа Тогда
			УстановленныеМетки(ТекСтрока.ПолучитьЭлементы(), ТабМетки);
			Продолжить;
		КонецЕсли;
		Если ТекСтрока.Использование = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ТабМетки.Найти(ТекСтрока.Метка, "Метка") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТабМетки.Добавить();
		НоваяСтрока.Метка = ТекСтрока.Метка;
	КонецЦикла;
	
	Возврат ТабМетки;
	
КонецФункции

// Заполняет строки дерева меток по переданному дереву значений
// 
// Параметры 
// 	Строки           	 -	СтрокиДереваЗначений     Строки дерева значений,
// 	Родитель        	 -	ДанныеФормыЭлементДерева Элемент дерева, в который добавляется новая строка.
//
&НаСервере 
Процедура ЗаполнитьСтрокиДереваМеток(Строки, Родитель = Неопределено)
	
	Родитель = ?(Родитель = Неопределено, Метки, Родитель);
	Для Каждого СтрокаДерева Из Строки Цикл 
		Если СтрокаДерева.Ссылка.ЭтоГруппа И
			СтрокаДерева.Строки.Количество() = 0  Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Метка = СтрокаДерева.Ссылка;
		НоваяСтрока.Использование = СтрокаДерева.Пометка;
		Если СтрокаДерева.Ссылка.ЭтоГруппа Тогда
			НоваяСтрока.Картинка = БиблиотекаКартинок.СправочникОбъект;
			НоваяСтрока.ЭтоГруппа = Истина;
		Иначе
			ВремКартинка = СтрокаДерева.Ссылка.Пиктограмма.Получить();
			Если ТипЗнч(ВремКартинка) = Тип("ДвоичныеДанные") Тогда
				ВремКартинка = Новый Картинка(ВремКартинка);
			КонецЕсли;
			Если НЕ ТипЗнч(ВремКартинка) = Тип("Картинка") ИЛИ ВремКартинка.Вид = ВидКартинки.Пустая Тогда
				ВремКартинка = БиблиотекаКартинок.бит_си_МеткаСтатьи;
			КонецЕсли;
			НоваяСтрока.Картинка = ВремКартинка;
		КонецЕсли;
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ЗаполнитьСтрокиДереваМеток(СтрокаДерева.Строки, НоваяСтрока);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет дерево меток.
// 
// Параметры 
// 	Статья		       	 -	СправочникСсылка.бит   	 Строки для заполнения,
// 	УстановленныеМетки 	 -	ТаблицаЗначений       	 Таблица меток, которые обязательно должны быть установленны,
// 	Обновлять        	 -	Булево              	 Проверка на необходимость заполнения.
//
&НаСервере
Процедура ЗаполнитьДеревоМеток(Знач Статья, Знач УстановленныеМетки = Неопределено, Знач Обновлять = Истина)
	
	Если Статья.ЭтоГруппа Или Не Обновлять Тогда
		Возврат;
	КонецЕсли;
	Метки.ПолучитьЭлементы().Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановленныеМетки.Метка
	               |ПОМЕСТИТЬ УстановленныеМетки
	               |ИЗ
	               |	&УстановленныеМетки КАК УстановленныеМетки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МеткиСтатей.Наименование КАК Метка,
	               |	ЕСТЬNULL(УстановленныеМетки.Пометка, 0) КАК Пометка,
	               |	МеткиСтатей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.бит_си_МеткиСтатей КАК МеткиСтатей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			УстановленныеМетки.Метка КАК Метка,
	               |			1 КАК Пометка
	               |		ИЗ
	               |			РегистрСведений.бит_си_УстановленныеМеткиСтатей КАК УстановленныеМетки
	               |		ГДЕ
	               |			УстановленныеМетки.Метка ССЫЛКА Справочник.бит_си_МеткиСтатей
	               |			И УстановленныеМетки.Статья = &Статья
	               |		
	               |		ОБЪЕДИНИТЬ
	               |		
	               |		ВЫБРАТЬ
	               |			УстановленныеМетки.Метка,
	               |			1
	               |		ИЗ
	               |			УстановленныеМетки КАК УстановленныеМетки) КАК УстановленныеМетки
	               |		ПО МеткиСтатей.Ссылка = УстановленныеМетки.Метка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка ИЕРАРХИЯ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Если НЕ ТипЗнч(УстановленныеМетки) = Тип("ТаблицаЗначений") Тогда
		УстановленныеМетки = Новый ТаблицаЗначений();
		УстановленныеМетки.Колонки.Добавить("Метка", Новый ОписаниеТипов("СправочникСсылка.бит_си_МеткиСтатей"));
	КонецЕсли;
	Запрос.УстановитьПараметр("Статья", Статья);
	Запрос.УстановитьПараметр("УстановленныеМетки", УстановленныеМетки);
	МеткиПер = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗаполнитьСтрокиДереваМеток(МеткиПер.Строки);
	
КонецПроцедуры

// Заполняет дерево отборов.
// 
// Параметры 
// 	Статья		       	 -	СправочникСсылка.бит   	 Строки для заполнения си_Статьи.
//
&НаСервере
Процедура ЗаполнитьДеревоОтборов(Статья)
	
	Если Статья.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	ОтборыОбъектов.ПолучитьЭлементы().Очистить();
	ВыборкаИсточников = Справочники.бит_си_Источники.Выбрать();
	МассивДобавленных = Новый Массив();
	Пока ВыборкаИсточников.Следующий() Цикл
		Если НЕ ВыборкаИсточников.Обработка.Получить() = "бит_си_ИсточникСправочникСтатьи" Тогда
			Продолжить;
		КонецЕсли;
		ТекНастройки = ВыборкаИсточников.НастройкаПоУмолчанию.Получить();
		Если НЕ ТипЗнч(ТекНастройки) = Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ТекНастройки.Свойство("ОбъектыОтбора") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ТекОбъект Из ТекНастройки.ОбъектыОтбора Цикл
			Если НЕ МассивДобавленных.Найти(ТекОбъект.МетаОбъект) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ОтборыОбъектов.ПолучитьЭлементы().Добавить();
			НоваяСтрока.Объект = ТекОбъект.Заголовок;
			НоваяСтрока.Тип = ТекОбъект.МетаОбъект;
			МассивДобавленных.Добавить(ТекОбъект.МетаОбъект);
		КонецЦикла;
	КонецЦикла;
	Если ОтборыОбъектов.ПолучитьЭлементы().Количество() = 0 Тогда
		Элементы.ОтборыОбъектов.Доступность = Ложь;
		Элементы.ОтборыОбъектов.КоманднаяПанель.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.ОтборыОбъектов.Доступность = Истина;
		Элементы.ОтборыОбъектов.КоманднаяПанель.Доступность = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбъектыОтбора.Объект КАК Объект,
	               |	ОбъектыОтбора.Тип КАК Тип
	               |ИЗ
	               |	РегистрСведений.бит_си_СвязанныеОбъекты КАК ОбъектыОтбора
	               |ГДЕ
	               |	ОбъектыОтбора.Статья = &Статья
	               |	И ОбъектыОтбора.ДляОтборов";
	Запрос.УстановитьПараметр("Статья", Статья);
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОбъектов.Следующий() Цикл
		СтрокиДерева = ОтборыОбъектов.ПолучитьЭлементы();
		СтрокаТипа = Неопределено;
		Для Каждого ТекСтрока Из СтрокиДерева Цикл
			Если ТекСтрока.Тип = ВыборкаОбъектов.Тип Тогда
				СтрокаТипа = ТекСтрока;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = СтрокаТипа.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Объект = ВыборкаОбъектов.Объект;
		НоваяСтрока.Тип = СтрокаТипа.Тип;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет дерево связанных объектов
// 
// Параметры 
// 	Статья		       	 -	СправочникСсылка.бит   	 Статья, для которой заполняются связанные объекты.
//
&НаСервере
Процедура ЗаполнитьДеревоСвязанныхОбъектов(Статья)
	
	Если Статья.ЭтоГруппа  Тогда
		Возврат;
	КонецЕсли;
	СвязанныеОбъекты.ПолучитьЭлементы().Очистить();
	ВыборкаИсточников = Справочники.бит_си_Источники.Выбрать();
	МассивДобавленных = Новый Массив();
	Пока ВыборкаИсточников.Следующий() Цикл
		Если НЕ ВыборкаИсточников.Обработка.Получить() = "бит_си_ИсточникСправочникСтатьи" Тогда
			Продолжить;
		КонецЕсли;
		ТекНастройки = ВыборкаИсточников.НастройкаПоУмолчанию.Получить();
		Если НЕ ТипЗнч(ТекНастройки) = Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ТекНастройки.Свойство("ОбъектыПривязки") Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ТекОбъект Из ТекНастройки.ОбъектыПривязки Цикл
			Если НЕ МассивДобавленных.Найти(ТекОбъект.МетаОбъект) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СвязанныеОбъекты.ПолучитьЭлементы().Добавить();
			НоваяСтрока.Объект = ТекОбъект.Заголовок;
			НоваяСтрока.Тип = ТекОбъект.МетаОбъект;
			МассивДобавленных.Добавить(ТекОбъект.МетаОбъект);
		КонецЦикла;
	КонецЦикла;
	Если ОтборыОбъектов.ПолучитьЭлементы().Количество() = 0 Тогда
		Элементы.СвязанныеОбъекты.Доступность = Ложь;
		Элементы.СвязанныеОбъекты.КоманднаяПанель.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.СвязанныеОбъекты.Доступность = Истина;
		Элементы.СвязанныеОбъекты.КоманднаяПанель.Доступность = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвязанныеОбъекты.Объект КАК Объект,
	               |	СвязанныеОбъекты.Тип КАК Тип
	               |ИЗ
	               |	РегистрСведений.бит_си_СвязанныеОбъекты КАК СвязанныеОбъекты
	               |ГДЕ
	               |	СвязанныеОбъекты.Статья = &Статья
	               |	И НЕ СвязанныеОбъекты.ДляОтборов";
	Запрос.УстановитьПараметр("Статья", Статья);
	ВыборкаОбъектов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОбъектов.Следующий() Цикл
		СтрокиДерева = СвязанныеОбъекты.ПолучитьЭлементы();
		СтрокаТипа = Неопределено;
		Для Каждого ТекСтрока Из СтрокиДерева Цикл
			Если ТекСтрока.Тип = ВыборкаОбъектов.Тип Тогда
				СтрокаТипа = ТекСтрока;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = СтрокаТипа.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Объект = ВыборкаОбъектов.Объект;
		НоваяСтрока.Тип = СтрокаТипа.Тип;
	КонецЦикла;
	
КонецПроцедуры

// Обновляет текст статьи.
// 
// Параметры 
// 	СтатьяСсылка       	 -	СправочникСсылка.
// 							бит_си_Статьи.
//
&НаСервере
Процедура ОбновитьТекстСтатьиНаСервере(СтатьяСсылка)
	
	Если НЕ ЗначениеЗаполнено(СтатьяСсылка) Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	СпрСпОб = Объект.Ссылка.ПолучитьОбъект();
	Если СпрСпОб = Неопределено Тогда
		СпрСпОб = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	ВремСписокКартинок = Новый СписокЗначений();
	РабочийТекстHTML = СпрСпОб.ЗагрузитьИзображенияИзБД(ЭтаФорма.УникальныйИдентификатор, ВремСписокКартинок);
	
	ТекстHTML = РабочийТекстHTML;
	СтруктураКартинок = Новый Структура();
	НомерКартинки = 0;
	Для Каждого ТекКартинка Из ВремСписокКартинок Цикл
		НомерКартинки = НомерКартинки + 1;
		Попытка
			СтруктураКартинок.Вставить("image" + СокрЛП(НомерКартинки), Новый Картинка(ТекКартинка.Значение));
		Исключение
			Продолжить;
		КонецПопытки;
		ТекстHTML = СтрЗаменить(ТекстHTML, ТекКартинка.Представление, "image" + СокрЛП(НомерКартинки));
	КонецЦикла;
	ТекстСтатьиРедактирование.УстановитьHTML(ТекстHTML, СтруктураКартинок);
	
КонецПроцедуры

// Создает статьи справки из данных строк дерева значений.
// 
// Параметры 
// 	СтрокаДерева       	 -	СтрокаДереваЗначений   	 Строка дерева, содержащая информацию для создания статьи справки.
// 		Поля 
// 			Представление  	 -	Строка   	 		 Наименование статьи справки,
// 			Иерархия	  	 -	Строка   	 		 Наименование объекта метаданных для привязки статьи справки,
// 			Файл		  	 -	Строка   	 		 Имя файла на диске, содержащего текст справки,
// 	Группа             	 -	СправочникСсылка.бит_си	 Группа справочника статей.                                       
//
&НаСервереБезКонтекста
Процедура СоздатьСтатьиСправки(СтрокаДерева, Группа)
	
	Для Каждого Объект Из СтрокаДерева.Строки Цикл
		Если НЕ Объект.Файл = "" Тогда
    		Статья = Справочники.бит_си_Статьи.НайтиПоНаименованию(Объект.Представление, Истина, Группа);
			Если Статья.ЭтоГруппа ИЛИ Статья.Пустая() Тогда
				Статья = Справочники.бит_си_Статьи.СоздатьЭлемент();
				Статья.Родитель = Группа;
				Статья.Наименование = Объект.Представление;
			Иначе
				Статья = Статья.ПолучитьОбъект();
			КонецЕсли;
			Статья.НазваниеСтатьи = Объект.Представление;
			Статья.МестаИспользования.Очистить();
			Место = Статья.МестаИспользования.Добавить();
			Место.ИмяМетки = Объект.Иерархия;
			Статья.Записать();
			ВремФайл = Новый Файл(Объект.Файл);
			ТекКаталог = ВремФайл.Путь;
			ВремФайл = Новый ТекстовыйДокумент();
			ВремФайл.Прочитать(Объект.Файл);
			Если Статья.СохранитьИзображенияВБД(ВремФайл.ПолучитьТекст(), ТекКаталог) Тогда
				Статья.Записать();
			КонецЕсли;
		Иначе
			ГруппаК = Справочники.бит_си_Статьи.НайтиПоНаименованию(Объект.Представление, Истина, Группа);
			Если НЕ ГруппаК.ЭтоГруппа ИЛИ ГруппаК.Пустая() Тогда
				ГруппаК = Справочники.бит_си_Статьи.СоздатьГруппу();
				ГруппаК.Родитель		= Группа;
				ГруппаК.Наименование	= Объект.Представление;
				ГруппаК.ОписаниеРаздела	= "";
				ГруппаК.Записать();
				ГруппаК = ГруппаК.Ссылка;
			КонецЕсли;
			СоздатьСтатьиСправки(Объект, ГруппаК);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
